# -*- coding:utf-8 -*-

"""
1.用你能想到的最少的代码生成一个包含100个key的字典，每个value的值不能一样

2.{‘k0’: 0, ‘k1’: 1, ‘k2’: 2, ‘k3’: 3, ‘k4’: 4, ‘k5’: 5, ‘k6’: 6, ‘k7’: 7, ‘k8’: 8, ‘k9’: 9} 请把这个dict中key大于5的值value打印出来。

3.把题2中value是偶数的统一改成-1

4.请设计一个dict, 存储你们公司每个人的信息， 信息包含至少姓名、年龄、电话、职位、工资，并提供一个简单的查找接口，用户按你的要求输入要查找的人，你的程序把查到的信息打印出来
"""
# 1.用你能想到的最少的代码生成一个包含100个key的字典，每个value的值不能一样

# dic_01 = {}
# for i in range(1, 101):
#     dic_01[i] = [i]
# print(dic_01)

# 2.{‘k0’: 0, ‘k1’: 1, ‘k2’: 2, ‘k3’: 3, ‘k4’: 4, ‘k5’: 5, ‘k6’: 6, ‘k7’: 7, ‘k8’: 8, ‘k9’: 9} 请把这个dict中key大于5的值value打印出来。

dic_02 = {'k0':0, 'k1':1, 'k2':2, 'k3':3, 'k4':4, 'k5':5, 'k6':6, 'k7':7, 'k8':8, 'k9':9}
for i in dic_02:
    print(i)