# -*- coding:utf-8 -*-

"""
1.用你能想到的最少的代码生成一个包含100个key的字典，每个value的值不能一样

2.{‘k0’: 0, ‘k1’: 1, ‘k2’: 2, ‘k3’: 3, ‘k4’: 4, ‘k5’: 5, ‘k6’: 6, ‘k7’: 7, ‘k8’: 8, ‘k9’: 9} 请把这个dict中key大于5的值value打印出来。

3.把题2中value是偶数的统一改成-1

4.请设计一个dict, 存储你们公司每个人的信息， 信息包含至少姓名、年龄、电话、职位、工资，并提供一个简单的查找接口，用户按你的要求输入要查找的人，你的程序把查到的信息打印出来
"""
# 1.用你能想到的最少的代码生成一个包含100个key的字典，每个value的值不能一样

# dic_01 = {}
# for i in range(1, 101):
#     dic_01[i] = [i]
# print(dic_01)

# 2.{‘k0’: 0, ‘k1’: 1, ‘k2’: 2, ‘k3’: 3, ‘k4’: 4, ‘k5’: 5, ‘k6’: 6, ‘k7’: 7, ‘k8’: 8, ‘k9’: 9} 请把这个dict中key大于5的值value打印出来。

# dic_02 = {'k0':0, 'k1':1, 'k2':2, 'k3':3, 'k4':4, 'k5':5, 'k6':6, 'k7':7, 'k8':8, 'k9':9}
# for i in dic_02:
#     a = i[1]
#     if a.isdigit():
#         a = int(a)
#     else:
#         continue
#     if a >= 5:
#         print(dic_02[i])

#3.把题2中value是偶数的统一改成-1

# dic_02 = {'k0':0, 'k1':1, 'k2':2, 'k3':3, 'k4':4, 'k5':5, 'k6':6, 'k7':7, 'k8':8, 'k9':9}
# for i in dic_02:
#     a = i[1]
#     if a.isdigit():
#         a = int(a)
#     else:
#         continue
#     if a >= 5:
#         if a%2 == 0:
#             dic_02[i] = -1
#             print(dic_02[i])
#         else:
#             print(dic_02[i])

#4.请设计一个dict, 存储你们公司每个人的信息， 信息包含至少姓名、年龄、电话、职位、工资，并提供一个简单的查找接口，用户按你的要求输入要查找的人，你的程序把查到的信息打印出来

dic_03 = {"zhangsan":["zhangsan", "24", "13326587957", "python开发工程师", "15000"], "lisi":["lisi", "30", "13324587957", "开发总监", "30000"]}
a = input("请输入要查询的姓名：")
if a in dic_03.keys():
    a_info = '''
    ------------ name: %s---------------
    name     : %s
    Age      : %s
    Number   : %s
    Position : %s
    wages    : %s
    ---------------- end ---------------
    ''' %(a, dic_03[a][0], dic_03[a][1], dic_03[a][2], dic_03[a][3], dic_03[a][4])
    print(a_info)
else:
    print("您查询的人不存在")